using System;

namespace Task_1
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /*
             
             Задание 1
             Написать программу, выводящую элементы двухмерного массива по диагонали.             
             
             */

            //Проинициализируем двухмерный массив 
            int[,] a = {
                { 1,  2,  3,  4,  5,  6,  7,  8,  9,  10, 100},
                { 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 200},
                { 31, 32, 33, 34, 35, 36, 37, 38, 39, 30, 300},
                { 41, 42, 43, 44, 45, 46, 47, 48, 49, 40, 400},
                { 51, 52, 53, 54, 55, 56, 57, 58, 59, 50, 500}
            };

            //Проходим по массиву циклом for
            for (int x = 0, y = 0; x <= a.GetUpperBound(1); x++, y++) //GetUpperBound(1) получаем индекс последнего элемента во втором измерении массива
            {
                if (y > a.GetUpperBound(0))                           //GetUpperBound(0) получаем индекс последнего элемента в первом измерении массива для условия проверки
                {
                    y = 0;
                }
                Console.WriteLine(a[y, x]);
            }
        }
    }
}
